Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.WrongDepthDimensionLabel
Multi-planar depth dimension label is already used for one of the planar shape parameters.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.ShapeFailure
The displayed Rebar Shape is created using a 'Rebar Bar for Preview'. This bar defines the bend radius displayed in the family. Using this preview bar the drawn shape cannot be completed.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.PlanarMultiPlanarShape
The current shape is only bent in a single plane. A multi-planar definition is not required. Please redefine the shape on the top plane only.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.ParameterValueNotDefined
Parameter assigned to the dimension has no value defined.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.MultipleArcsMustOverlap
Multiple arcs are supported only if they are concentric and form a circle with an overlap.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.MultiPlanarDepth
Multi-planar depth of Rebar Shape can't be too small.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.FormulaDrivenDimension
Dimension can't be driven by a formula parameter.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DimensionWithoutParameter
Dimension has no parameter assigned to it.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DimensionWithCommonLengthUnit
A shape dimension is labelled with a parameter that uses the Common Length unit.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DimensionLoose
This dimension cannot be used to parameterize the Rebar Shape.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DiagonalEdgesAreUnderconstrained
Shape is underconstrained. Please add additional dimension constraints to the shape's diagonal edges. (Diagonal segments with only one dimension constraint are automatically given a second constraint to lie at an angle of exactly 45 degrees, regardless of how they are drawn. The current shape has more than one such segment in sequence, and the resulting constrained edges are co-linear.)

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DepthDimensionNotExisted
Multi-planar shape's depth dimension has been deleted. Please assign a new one to multi-planar depth.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DefaultParamaterValuesIncorrect
Default parameters have incorrect values. One reason for failure might be an edge length that is too short (it's smaller than bent radius).

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurvesUnlooped
Segments defining the Rebar Shape must be in a continuous loop.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurvesCollinear
Collinear segments are not allowed in a Rebar Shape definition.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurveUnderconstrained
Segment is underconstrained. It requires additional parameterized dimensions.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurveOverconstrained
Segment is overconstrained. It has at least one parameterized dimension that conflicts with another dimension.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CircleUnbounded
An unbounded circle can only be used to construct a spiral shape.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CircleMultiPlanarShape
A circle can't be converted to multiplanar shape.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures
Failures about RebarShape.